In [3]:
from numpy.random import randn as rn

In [4]:
rn(5,4)

array([[ 0.30564369, -0.28797295,  0.04049891,  0.16815443],
       [ 0.02007797, -1.46428697, -1.88048027,  0.38334331],
       [ 1.11804296, -1.63564484, -0.58572287,  2.1444374 ],
       [-0.60358884,  0.32061665, -0.21334163, -0.33676024],
       [ 0.45325047,  1.35450499,  0.22660839, -0.89118106]])

In [5]:
r = rn(5,4)

In [6]:
r

array([[-0.89130186,  1.06380536,  1.73726676,  0.95928055],
       [ 0.4426538 , -0.29916882, -0.28199247, -0.49639062],
       [ 2.05453282,  0.71790502,  1.74735533,  1.21284865],
       [ 2.73013303,  0.29349532,  0.42728993, -0.80035189],
       [-0.27649513, -0.05793509,  0.30591388,  0.33529304]])

In [7]:
import numpy as np
np.random.seed(100)
r = rn(5,4)

In [8]:
r

array([[-1.74976547,  0.3426804 ,  1.1530358 , -0.25243604],
       [ 0.98132079,  0.51421884,  0.22117967, -1.07004333],
       [-0.18949583,  0.25500144, -0.45802699,  0.43516349],
       [-0.58359505,  0.81684707,  0.67272081, -0.10441114],
       [-0.53128038,  1.02973269, -0.43813562, -1.11831825]])

In [9]:
import pandas as pd

In [10]:
pd.DataFrame(r)

          0         1         2         3
0 -1.749765  0.342680  1.153036 -0.252436
1  0.981321  0.514219  0.221180 -1.070043
2 -0.189496  0.255001 -0.458027  0.435163
3 -0.583595  0.816847  0.672721 -0.104411
4 -0.531280  1.029733 -0.438136 -1.118318

In [11]:
row=['A','B','C','D','E']
col=['w','x','y','z']

In [12]:
df = pd.DataFrame(r ,index=row,columns=col)
df

          w         x         y         z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [13]:
df.loc[['A','B'],['w','y']]

          w         y
A -1.749765  1.153036
B  0.981321  0.221180

In [14]:
df.iloc[[0,4]]

          w         x         y         z
A -1.749765  0.342680  1.153036 -0.252436
E -0.531280  1.029733 -0.438136 -1.118318

In [15]:
df.iloc[::-1,1:3]

          x         y
E  1.029733 -0.438136
D  0.816847  0.672721
C  0.255001 -0.458027
B  0.514219  0.221180
A  0.342680  1.153036

In [16]:
df.loc['A'].iloc[0]

-1.7497654730546974

In [17]:
df.ix[::2,['W']]

AttributeError: 'DataFrame' object has no attribute 'ix'

In [19]:
df<-1

       w      x      y      z
A   True  False  False  False
B  False  False  False   True
C  False  False  False  False
D  False  False  False  False
E  False  False  False   True

In [20]:
df[df>1]

    w         x         y   z
A NaN       NaN  1.153036 NaN
B NaN       NaN       NaN NaN
C NaN       NaN       NaN NaN
D NaN       NaN       NaN NaN
E NaN  1.029733       NaN NaN

In [21]:
df

          w         x         y         z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [24]:
df[df.loc[['A','B']]>1]

    w   x         y   z
A NaN NaN  1.153036 NaN
B NaN NaN       NaN NaN
C NaN NaN       NaN NaN
D NaN NaN       NaN NaN
E NaN NaN       NaN NaN

In [30]:
df['x']

A    0.342680
B    0.514219
C    0.255001
D    0.816847
E    1.029733
Name: x, dtype: float64

In [32]:
df[df['x']>0.3]

          w         x         y         z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [36]:
df[(df['x']>0) & (df['y']>0)]['w']

A   -1.749765
B    0.981321
D   -0.583595
Name: w, dtype: float64

In [39]:
df.reset_index(drop=True,inplace=True)

In [40]:
df

          w         x         y         z
0 -1.749765  0.342680  1.153036 -0.252436
1  0.981321  0.514219  0.221180 -1.070043
2 -0.189496  0.255001 -0.458027  0.435163
3 -0.583595  0.816847  0.672721 -0.104411
4 -0.531280  1.029733 -0.438136 -1.118318

In [43]:
#inplace is like commit
df.set_index('z',inplace=True)

In [44]:
df

                  w         x         y
z
-0.252436 -1.749765  0.342680  1.153036
-1.070043  0.981321  0.514219  0.221180
 0.435163 -0.189496  0.255001 -0.458027
-0.104411 -0.583595  0.816847  0.672721
-1.118318 -0.531280  1.029733 -0.438136

In [45]:
#random data number is not complete
df.loc[-0.252436]

KeyError: -0.252436

In [46]:
df.index

Float64Index([-0.25243603652138985,  -1.0700433305682933,  0.43516348812289213,
              -0.10441114339062771,  -1.1183182462554362],
             dtype='float64', name='z')

In [47]:
df.loc[-0.25243603652138985]

w   -1.749765
x    0.342680
y    1.153036
Name: -0.25243603652138985, dtype: float64

In [49]:
l= 'ankita ki ran mou rya'
df['n'] = l.split()

In [50]:
df

                  w         x         y       n
z
-0.252436 -1.749765  0.342680  1.153036  ankita
-1.070043  0.981321  0.514219  0.221180      ki
 0.435163 -0.189496  0.255001 -0.458027     ran
-0.104411 -0.583595  0.816847  0.672721     mou
-1.118318 -0.531280  1.029733 -0.438136     rya

In [52]:
df.set_index('n',inplace=True)

In [53]:
df

               w         x         y
n
ankita -1.749765  0.342680  1.153036
ki      0.981321  0.514219  0.221180
ran    -0.189496  0.255001 -0.458027
mou    -0.583595  0.816847  0.672721
rya    -0.531280  1.029733 -0.438136

In [54]:
df.loc[['ankita','ki']]

               w         x         y
n
ankita -1.749765  0.342680  1.153036
ki      0.981321  0.514219  0.221180

In [55]:
df.iloc[0,1]

0.34268040332750216

In [56]:
df.iloc[[0,1]]

               w         x         y
n
ankita -1.749765  0.342680  1.153036
ki      0.981321  0.514219  0.221180

In [60]:
df1 = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[7,5,np.nan]})

In [61]:
df1

     A    B    C
0  1.0  5.0  7.0
1  2.0  NaN  5.0
2  NaN  NaN  NaN

In [64]:
#thresh=1 is atleast one NaN value can stay
df1.dropna(axis=0,thresh=1)

     A    B    C
0  1.0  5.0  7.0
1  2.0  NaN  5.0

In [65]:
df1

     A    B    C
0  1.0  5.0  7.0
1  2.0  NaN  5.0
2  NaN  NaN  NaN

In [66]:
df1.fillna(5)

     A    B    C
0  1.0  5.0  7.0
1  2.0  5.0  5.0
2  5.0  5.0  5.0

In [67]:
df1.fillna(df1['A'].mean())

     A    B    C
0  1.0  5.0  7.0
1  2.0  1.5  5.0
2  1.5  1.5  1.5

In [83]:
d = {'name' : ['ankita','burnwal','kiran','kiran','abc','xyz','abc','abc'],
     'salary' : [100,200,300,400,500,600,200,800],
     'company' : ['ineuron','tcs','ibm','capgemini','cts','hp','intel','hp']
    }

In [84]:
d

{'name': ['ankita', 'burnwal', 'kiran', 'kiran', 'abc', 'xyz', 'abc', 'abc'],
 'salary': [100, 200, 300, 400, 500, 600, 200, 800],
 'company': ['ineuron', 'tcs', 'ibm', 'capgemini', 'cts', 'hp', 'intel', 'hp']}

In [85]:
df2= pd.DataFrame(d)

In [86]:
df2

      name  salary    company
0   ankita     100    ineuron
1  burnwal     200        tcs
2    kiran     300        ibm
3    kiran     400  capgemini
4      abc     500        cts
5      xyz     600         hp
6      abc     200      intel
7      abc     800         hp

In [87]:
df2.groupby('name').sum()

         salary
name
abc        1500
ankita      100
burnwal     200
kiran       700
xyz         600

In [89]:
df3 = df2.groupby('name').describe()

In [90]:
df3

        salary
         count   mean         std    min    25%    50%    75%    max
name
abc        3.0  500.0  300.000000  200.0  350.0  500.0  650.0  800.0
ankita     1.0  100.0         NaN  100.0  100.0  100.0  100.0  100.0
burnwal    1.0  200.0         NaN  200.0  200.0  200.0  200.0  200.0
kiran      2.0  350.0   70.710678  300.0  325.0  350.0  375.0  400.0
xyz        1.0  600.0         NaN  600.0  600.0  600.0  600.0  600.0

In [93]:
df3['salary']['min']

name
abc        200.0
ankita     100.0
burnwal    200.0
kiran      300.0
xyz        600.0
Name: min, dtype: float64

In [95]:
df4 = df3.loc['ankita']

In [96]:
df4

salary  count      1.0
        mean     100.0
        std        NaN
        min      100.0
        25%      100.0
        50%      100.0
        75%      100.0
        max      100.0
Name: ankita, dtype: float64

In [97]:
df4.loc['salary'].loc['mean']

100.0

In [104]:
df5 = pd.DataFrame(df2.groupby('name').describe().loc['ankita']).transpose()

In [105]:
df5

       salary
        count   mean std    min    25%    50%    75%    max
ankita    1.0  100.0 NaN  100.0  100.0  100.0  100.0  100.0

In [106]:
df5['salary']['min']

ankita    100.0
Name: min, dtype: float64

In [107]:
daf1 = pd.DataFrame({'A':[2,3,4,5],
                     'B':[5,7,9,8],
                     'C':[23,24,25,26]},
                    index  = [0,1,2,3])

In [108]:
daf1

   A  B   C
0  2  5  23
1  3  7  24
2  4  9  25
3  5  8  26

In [115]:
daf2 = pd.DataFrame({'A':[2,3,4,5],
                     'B':[5,7,9,8],
                     'C':[23,24,25,26]},
                    index  = [0,6,7,8])
daf2

   A  B   C
0  2  5  23
6  3  7  24
7  4  9  25
8  5  8  26

In [110]:
daf3 = pd.DataFrame({'A':[2,3,4,5],
                     'B':[5,7,9,8],
                     'C':[23,24,25,26]},
                    index  = [9,10,11,12])
daf3

    A  B   C
9   2  5  23
10  3  7  24
11  4  9  25
12  5  8  26

In [125]:
df11 = pd.concat([daf1,daf2,daf3],axis=1)

In [126]:
df11

      A    B     C    A    B     C    A    B     C
0   2.0  5.0  23.0  2.0  5.0  23.0  NaN  NaN   NaN
1   3.0  7.0  24.0  NaN  NaN   NaN  NaN  NaN   NaN
2   4.0  9.0  25.0  NaN  NaN   NaN  NaN  NaN   NaN
3   5.0  8.0  26.0  NaN  NaN   NaN  NaN  NaN   NaN
6   NaN  NaN   NaN  3.0  7.0  24.0  NaN  NaN   NaN
7   NaN  NaN   NaN  4.0  9.0  25.0  NaN  NaN   NaN
8   NaN  NaN   NaN  5.0  8.0  26.0  NaN  NaN   NaN
9   NaN  NaN   NaN  NaN  NaN   NaN  2.0  5.0  23.0
10  NaN  NaN   NaN  NaN  NaN   NaN  3.0  7.0  24.0
11  NaN  NaN   NaN  NaN  NaN   NaN  4.0  9.0  25.0
12  NaN  NaN   NaN  NaN  NaN   NaN  5.0  8.0  26.0

In [132]:
df11['A']

      A    A    A
0   2.0  2.0  NaN
1   3.0  NaN  NaN
2   4.0  NaN  NaN
3   5.0  NaN  NaN
6   NaN  3.0  NaN
7   NaN  4.0  NaN
8   NaN  5.0  NaN
9   NaN  NaN  2.0
10  NaN  NaN  3.0
11  NaN  NaN  4.0
12  NaN  NaN  5.0

In [131]:
df11.loc[0]

A     2.0
B     5.0
C    23.0
A     2.0
B     5.0
C    23.0
A     NaN
B     NaN
C     NaN
Name: 0, dtype: float64

In [133]:
df11.iloc[:,0]

0     2.0
1     3.0
2     4.0
3     5.0
6     NaN
7     NaN
8     NaN
9     NaN
10    NaN
11    NaN
12    NaN
Name: A, dtype: float64

In [130]:
df11.iloc[:,0]

0     2.0
1     3.0
2     4.0
3     5.0
6     NaN
7     NaN
8     NaN
9     NaN
10    NaN
11    NaN
12    NaN
Name: A, dtype: float64

In [136]:
df1 = pd.DataFrame({'key' : ['k0','k1','k2','k3'],
                 'x' : [1,2,3,4],
                 'y' : [4,5,6,7]})
df1

  key  x  y
0  k0  1  4
1  k1  2  5
2  k2  3  6
3  k3  4  7

In [137]:
df2 = pd.DataFrame({'key' : ['k0','k6','k2','k8'],
                 'a' : [1,2,3,4],
                 'b' : [4,5,6,7]})
df2

  key  a  b
0  k0  1  4
1  k6  2  5
2  k2  3  6
3  k8  4  7

In [138]:
pd.merge(df1,df2)

  key  x  y  a  b
0  k0  1  4  1  4
1  k2  3  6  3  6

In [139]:
pd.merge(df1,df2,how='left',on='key')

  key  x  y    a    b
0  k0  1  4  1.0  4.0
1  k1  2  5  NaN  NaN
2  k2  3  6  3.0  6.0
3  k3  4  7  NaN  NaN

In [140]:
df1.set_index('key',inplace=True)

In [141]:
df1

     x  y
key
k0   1  4
k1   2  5
k2   3  6
k3   4  7

In [142]:
df2.set_index('key',inplace=True)

In [143]:
df2

     a  b
key
k0   1  4
k6   2  5
k2   3  6
k8   4  7

In [147]:
#in case of join we have to provide index and 
#in merge we have to give column name

df1.join(df2,how = 'outer',lsuffix='x')

       x    y    a    b
key
k0   1.0  4.0  1.0  4.0
k1   2.0  5.0  NaN  NaN
k2   3.0  6.0  3.0  6.0
k3   4.0  7.0  NaN  NaN
k6   NaN  NaN  2.0  5.0
k8   NaN  NaN  4.0  7.0

In [148]:

df1.join(df2,how = 'outer')

       x    y    a    b
key
k0   1.0  4.0  1.0  4.0
k1   2.0  5.0  NaN  NaN
k2   3.0  6.0  3.0  6.0
k3   4.0  7.0  NaN  NaN
k6   NaN  NaN  2.0  5.0
k8   NaN  NaN  4.0  7.0